In [2]:
import pandas as pd

data = {
    'Name': ['Microsoft Corporation', 'Google, LLC', 'Tesla, Inc.',\
             'Apple Inc.', 'Netflix, Inc.'],
    'Symbol': ['MSFT', 'GOOG', 'TSLA', 'AAPL', 'NFLX'],
    'Industry': ['Tech', 'Tech', 'Automotive', 'Tech', 'Entertainment'],
    'Shares': [100, 50, 150, 200, 80]
}

df = pd.DataFrame(data)
df

                    Name Symbol       Industry  Shares
0  Microsoft Corporation   MSFT           Tech     100
1            Google, LLC   GOOG           Tech      50
2            Tesla, Inc.   TSLA     Automotive     150
3             Apple Inc.   AAPL           Tech     200
4          Netflix, Inc.   NFLX  Entertainment      80

In [8]:
list1 = df.loc[df["Symbol"]=="NFLX"].values.tolist()[0]
list1

['Netflix, Inc.', 'NFLX', 'Entertainment', 80]

In [5]:
df2 = df.set_index("Symbol")
df2

                         Name       Industry  Shares
Symbol
MSFT    Microsoft Corporation           Tech     100
GOOG              Google, LLC           Tech      50
TSLA              Tesla, Inc.     Automotive     150
AAPL               Apple Inc.           Tech     200
NFLX            Netflix, Inc.  Entertainment      80

In [6]:
list2 = df2.loc['NFLX'].values.tolist()
list2

['Netflix, Inc.', 'Entertainment', 80]

source: https://datascienceparichay.com/article/pandas-dataframe-to-a-list-in-python/